# Data in Motion Weekly Data Analysis Challenge
## Week 11: JSON Files

Link to dataset:  https://buff.ly/3wV0BZT 

Challenge Questions:
1.    Read in the JSON file.
2.    Flatten the nested list from JSON object.
3.    Create a dataframe that includes the flatten list and all original columns

In [1]:
# import libraries
import urllib.request
import json
from flatten_json import flatten
import pandas as pd

### 1. Read in the JSON file.

In [2]:
# read in JSON file
with urllib.request.urlopen('https://buff.ly/3wV0BZT') as url:
    data = json.load(url)

### 2. Flatten the nested list from JSON object.

In [3]:
flat_json = flatten(data)

In [4]:
flat_json

{'school_name': 'ABC primary school',
 'class': 'Year 1',
 'students_0_id': 'A001',
 'students_0_name': 'Tom',
 'students_0_math': 60,
 'students_0_physics': 66,
 'students_0_chemistry': 61,
 'students_1_id': 'A002',
 'students_1_name': 'James',
 'students_1_math': 89,
 'students_1_physics': 76,
 'students_1_chemistry': 51,
 'students_2_id': 'A003',
 'students_2_name': 'Jenny',
 'students_2_math': 79,
 'students_2_physics': 90,
 'students_2_chemistry': 78}

### 3. Create a dataframe that includes the flatten list and all original columns

In [5]:
df = pd.DataFrame(flat_json, index=[0])

In [6]:
df

,school_name,class,students_0_id,students_0_name,students_0_math,students_0_physics,students_0_chemistry,students_1_id,students_1_name,students_1_math,students_1_physics,students_1_chemistry,students_2_id,students_2_name,students_2_math,students_2_physics,students_2_chemistry
0,ABC primary school,Year 1,A001,Tom,60,66,61,A002,James,89,76,51,A003,Jenny,79,90,78